anthropic.claude-code
arrterian.nix-env-selector
dreamcatcher45.podmanager
esbenp.prettier-vscode
github.vscode-github-actions
gitlab.gitlab-workflow
golang.go
jeanp413.open-remote-ssh
jnoortheen.nix-ide
k--kato.intellij-idea-keybindings
mermaidchart.vscode-mermaid-chart
mkhl.direnv
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.powershell
pinage404.nix-extension-pack
rust-lang.rust-analyzer
